{
  "characters": [
    {
      "id": 1,
      "name": {
        "en": "Krishna",
        "hi": "कृष्ण"
      },
      "key_traits": {
        "en": "Divine wisdom, Strategic mind, Compassion",
        "hi": "दिव्य ज्ञान, रणनीतिक मन, करुणा"
      },
      "life_lesson": {
        "en": "Strategy & Calm Mind - Face challenges with wisdom and composure",
        "hi": "रणनीति और शांत मन - ज्ञान और संयम के साथ चुनौतियों का सामना करें"
      },
      "story": {
        "en": "Lord Krishna, the eighth avatar of Vishnu, is the embodiment of divine wisdom and strategic brilliance. Throughout the Mahabharata, he serves as Arjuna's charioteer and guide, particularly during the pivotal Battle of Kurukshetra.\n\nWhen Arjuna faced a moral crisis on the battlefield, refusing to fight his own relatives, Krishna didn't force him or judge him. Instead, he calmly shared the teachings of the Bhagavad Gita, explaining dharma (duty), karma (action), and the eternal nature of the soul. His words transformed Arjuna's despair into clarity and determination.\n\nKrishna's strategy was never about brute force but about understanding the bigger picture. He knew when to act, when to wait, and when to speak. During the war, his tactical advice helped the Pandavas overcome seemingly impossible odds. Yet, he never fought himself, showing that true leadership is about empowering others.\n\nHis life teaches us that wisdom isn't about having all the answers immediately, but about maintaining calm in chaos, thinking strategically, and acting with compassion. Whether in personal relationships, professional challenges, or moral dilemmas, Krishna's approach reminds us to step back, observe, and respond with both heart and mind.",
        "hi": "भगवान कृष्ण, विष्णु के आठवें अवतार, दिव्य ज्ञान और रणनीतिक प्रतिभा के अवतार हैं। महाभारत में, वे अर्जुन के सारथी और मार्गदर्शक के रूप में कार्य करते हैं, विशेष रूप से कुरुक्षेत्र के निर्णायक युद्ध के दौरान।\n\nजब अर्जुन युद्धभूमि पर नैतिक संकट का सामना कर रहे थे, अपने ही रिश्तेदारों से लड़ने से इनकार कर रहे थे, तब कृष्ण ने उन्हें मजबूर नहीं किया या उनका न्याय नहीं किया। इसके बजाय, उन्होंने शांति से भगवद गीता की शिक्षाओं को साझा किया, धर्म (कर्तव्य), कर्म (कार्य), और आत्मा की शाश्वत प्रकृति को समझाया। उनके शब्दों ने अर्जुन की निराशा को स्पष्टता और दृढ़ संकल्प में बदल दिया।\n\nकृष्ण की रणनीति कभी भी बल के बारे में नहीं थी बल्कि बड़ी तस्वीर को समझने के बारे में थी। वे जानते थे कि कब कार्य करना है, कब प्रतीक्षा करनी है, और कब बोलना है। युद्ध के दौरान, उनकी रणनीतिक सलाह ने पांडवों को असंभव बाधाओं को पार करने में मदद की। फिर भी, उन्होंने स्वयं कभी नहीं लड़ा, यह दिखाते हुए कि सच्चा नेतृत्व दूसरों को सशक्त बनाने के बारे में है।\n\nउनका जीवन हमें सिखाता है कि ज्ञान तुरंत सभी उत्तर रखने के बारे में नहीं है, बल्कि अराजकता में शांत रहने, रणनीतिक रूप से सोचने और करुणा के साथ कार्य करने के बारे में है। व्यक्तिगत संबंधों, पेशेवर चुनौतियों, या नैतिक दुविधाओं में, कृष्ण का दृष्टिकोण हमें याद दिलाता है कि पीछे हटें, निरीक्षण करें, और दिल और दिमाग दोनों के साथ प्रतिक्रिया दें।"
      },
      "shloka": {
        "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
        "transliteration": "yogasthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
        "meaning": {
          "en": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called yoga.",
          "hi": "हे अर्जुन, सफलता या असफलता की सभी आसक्ति को त्यागकर, समभाव में स्थित होकर अपने कर्तव्य का पालन करो। ऐसी समता को योग कहा जाता है।"
        },
        "reference": "Bhagavad Gita 2.48"
      }
    },
    {
      "id": 2,
      "name": {
        "en": "Arjuna",
        "hi": "अर्जुन"
      },
      "key_traits": {
        "en": "Skilled warrior, Humble learner, Dutiful",
        "hi": "कुशल योद्धा, विनम्र शिक्षार्थी, कर्तव्यनिष्ठ"
      },
      "life_lesson": {
        "en": "Doubt Before Growth - Questions lead to clarity and wisdom",
        "hi": "विकास से पहले संदेह - प्रश्न स्पष्टता और ज्ञान की ओर ले जाते हैं"
      },
      "story": {
        "en": "Arjuna, the greatest archer of his time and the third Pandava brother, represents the journey from confusion to clarity. Known for his dedication and skill, Arjuna's most profound moment came not in victory, but in doubt.\n\nOn the battlefield of Kurukshetra, surrounded by his family on both sides, Arjuna's bow slipped from his hands. The mighty warrior who had never hesitated before was paralyzed by a moral crisis. Should he fight his own cousins, teachers, and relatives for a kingdom? Was victory worth the price of his loved ones' blood?\n\nThis moment of doubt was not weakness—it was the beginning of wisdom. Arjuna asked questions, admitted his confusion, and sought guidance from Krishna. His willingness to acknowledge uncertainty led to the teachings of the Bhagavad Gita, one of humanity's greatest philosophical texts.\n\nThroughout his life, Arjuna showed that being a learner is more important than pretending to know everything. He asked questions during his training with Dronacharya, sought advice from Krishna, and remained humble despite his extraordinary abilities.\n\nArjuna's story teaches us that doubt is not the enemy of faith or action—it's the pathway to deeper understanding. The courage to question, to admit confusion, and to seek wisdom is what transforms us from merely skilled individuals into truly wise ones. Growth begins when we're brave enough to say, 'I don't know, help me understand.'",
        "hi": "अर्जुन, अपने समय के महानतम धनुर्धर और तीसरे पांडव भाई, भ्रम से स्पष्टता की यात्रा का प्रतिनिधित्व करते हैं। अपनी समर्पण और कौशल के लिए जाने जाते हैं, अर्जुन का सबसे गहरा क्षण जीत में नहीं, बल्कि संदेह में आया।\n\nकुरुक्षेत्र के युद्धभूमि पर, दोनों तरफ अपने परिवार से घिरे हुए, अर्जुन का धनुष उनके हाथों से फिसल गया। वह शक्तिशाली योद्धा जिसने पहले कभी संकोच नहीं किया था, एक नैतिक संकट से पंगु हो गया। क्या उसे एक राज्य के लिए अपने चचेरे भाइयों, शिक्षकों और रिश्तेदारों से लड़ना चाहिए? क्या जीत अपने प्रियजनों के खून की कीमत के लायक थी?\n\nसंदेह का यह क्षण कमजोरी नहीं था - यह ज्ञान की शुरुआत थी। अर्जुन ने प्रश्न पूछे, अपनी भ्रम को स्वीकार किया, और कृष्ण से मार्गदर्शन मांगा। अनिश्चितता को स्वीकार करने की उनकी इच्छा ने भगवद गीता की शिक्षाओं को जन्म दिया, मानवता के सबसे महान दार्शनिक ग्रंथों में से एक।\n\nअपने पूरे जीवन में, अर्जुन ने दिखाया कि एक सीखने वाला होना सब कुछ जानने का दिखावा करने से अधिक महत्वपूर्ण है। उन्होंने द्रोणाचार्य के साथ अपने प्रशिक्षण के दौरान प्रश्न पूछे, कृष्ण से सलाह मांगी, और अपनी असाधारण क्षमताओं के बावजूद विनम्र रहे।\n\nअर्जुन की कहानी हमें सिखाती है कि संदेह विश्वास या कार्य का दुश्मन नहीं है - यह गहरी समझ का मार्ग है। प्रश्न करने, भ्रम स्वीकार करने, और ज्ञान खोजने का साहस ही हमें केवल कुशल व्यक्तियों से वास्तव में बुद्धिमान बनाता है। विकास तब शुरू होता है जब हम कहने के लिए पर्याप्त बहादुर होते हैं, 'मुझे नहीं पता, मुझे समझने में मदद करो।'"
      },
      "shloka": {
        "sanskrit": "कार्पण्यदोषोपहतस्वभावः पृच्छामि त्वां धर्मसम्मूढचेताः। यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्॥",
        "transliteration": "kārpaṇya-doṣopahata-svabhāvaḥ pṛcchāmi tvāṁ dharma-sammūḍha-cetāḥ | yac chreyaḥ syān niścitaṁ brūhi tan me śiṣyas te 'haṁ śādhi māṁ tvāṁ prapannam ||",
        "meaning": {
          "en": "My nature is overwhelmed by weakness and pity. My mind is confused about dharma. I ask you, tell me decisively what is best. I am your disciple; please instruct me who has taken shelter in you.",
          "hi": "मेरा स्वभाव कमजोरी और दया से अभिभूत है। मेरा मन धर्म के बारे में भ्रमित है। मैं आपसे पूछता हूं, मुझे निश्चित रूप से बताएं कि क्या सबसे अच्छा है। मैं आपका शिष्य हूं; कृपया मुझे निर्देश दें जो आपकी शरण में आया है।"
        },
        "reference": "Bhagavad Gita 2.7"
      }
    }








  ],
  "quotes": [
    
    {
    "id": 1,
    "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
    "transliteration": "yogasthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya | siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate ||",
    "meaning": {
      "en": "Perform your duty with equanimity, abandoning attachment to success and failure. Such balance is called Yoga.",
      "hi": "हे धनंजय! सफलता और असफलता के प्रति आसक्ति त्यागकर समभाव से अपना कर्तव्य करो। यही योग कहलाता है।"
    },
    "reference": "Bhagavad Gita 2.48",
    "category": "Action"
  },
  {
    "id": 2,
    "sanskrit": "न जायते म्रियते वा कदाचिन्\nनायं भूत्वा भविता वा न भूयः। अजो नित्यः शाश्वतोऽयं पुराणो\nन हन्यते हन्यमाने शरीरे॥",
    "transliteration": "na jāyate mriyate vā kadācin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ | ajo nityaḥ śāśvato 'yaṁ purāṇo na hanyate hanyamāne śarīre ||",
    "meaning": {
      "en": "The soul is never born nor does it die. It is eternal and is not destroyed when the body is destroyed.",
      "hi": "आत्मा न जन्म लेती है न मरती है। शरीर के नष्ट होने पर भी आत्मा नष्ट नहीं होती।"
    },
    "reference": "Bhagavad Gita 2.20",
    "category": "Soul"
  }



]

  
}
